FutureDesigns/uEZ/uEZ/Source/Devices/USBDevice/NXP/LPC17xx_40xx/LPC17xx_40xx_USBDevice.c
    // Allow only one endpoint processing at a time
    error = UEZSemaphoreGrab(p->iProcess, aTimeout);
    if (error != UEZ_ERROR_NONE)
        return error;

    // Wait until it is ready (or timeout) which might occur
    // before we get to this line.
    error = UEZSemaphoreGrab(p->iReady, aTimeout);
    if (error == UEZ_ERROR_NONE) {
        // Got the semaphore, which means 1 or more endpoints are
        // ready to process.  Process all the endpoints.
        (*p->iUSBDeviceController)->ProcessEndpoints(p->iUSBDeviceController);

    }

    // At this point, either it occured, or we timed out.
    // In either case, go on.  We'll return the error to the
    // caller.

    // Done with this request, allow the next one to occur.
    UEZSemaphoreRelease(p->iProcess);

    return error;
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC17xx_40xx_USBDevice_Connect
 *-------------------------------------------------------------------------*
 * Description:
 *      Connect to the USB bus.
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *-------------------------------------------------------------------------*/
static void NXP_LPC17xx_40xx_USBDevice_Connect(void *aWorkspace)
{
    T_USBDevice_LPC17xx_40xx_Workspace *p =
        (T_USBDevice_LPC17xx_40xx_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    (*p->iUSBDeviceController)->Connect(p->iUSBDeviceController);
    UEZSemaphoreRelease(p->iSem);
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC17xx_40xx_USBDevice_Disconnect
 *-------------------------------------------------------------------------*
 * Description:
 *      Disconnect from the USB bus.
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *-------------------------------------------------------------------------*/
static void NXP_LPC17xx_40xx_USBDevice_Disconnect(void *aWorkspace)
{
    T_USBDevice_LPC17xx_40xx_Workspace *p =
        (T_USBDevice_LPC17xx_40xx_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    (*p->iUSBDeviceController)->Disconnect(p->iUSBDeviceController);
    UEZSemaphoreRelease(p->iSem);
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC17xx_40xx_USBDevice_SetAddress
 *-------------------------------------------------------------------------*
 * Description:
 *      Sets the USB address for this device.
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *      TUInt8 aAddress             -- 7 bit address of this device.
 *-------------------------------------------------------------------------*/
static void NXP_LPC17xx_40xx_USBDevice_SetAddress(void *aWorkspace, TUInt8 aAddress)
{
    T_USBDevice_LPC17xx_40xx_Workspace *p =
        (T_USBDevice_LPC17xx_40xx_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
//    (*p->iUSBDeviceController)->SetAddress(
//            p->iUSBDeviceController,
//            aAddress);
    p->iNeedSetAddress = ETrue;
    p->iUSBAddress = aAddress;
    UEZSemaphoreRelease(p->iSem);
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC17xx_40xx_USBDevice_EndpointConfigure
 *-------------------------------------------------------------------------*
 * Description:
 *      Realize and enable an endpoint.
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *      TUInt8 aEndpoint            -- Endpoint identifier
 *      TUInt16 aMaxPacketSize      -- Maximum size of packets
 *-------------------------------------------------------------------------*/
static void NXP_LPC17xx_40xx_USBDevice_EndpointConfigure(
            void *aWorkspace,
            TUInt8 aEndpoint,
            TUInt16 aMaxPacketSize)
{
    T_USBDevice_LPC17xx_40xx_Workspace *p =
        (T_USBDevice_LPC17xx_40xx_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    (*p->iUSBDeviceController)->EndpointConfigure(
            p->iUSBDeviceController,
            aEndpoint,
            aMaxPacketSize);
    UEZSemaphoreRelease(p->iSem);
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC17xx_40xx_USBDevice_Read
 *-------------------------------------------------------------------------*
 * Description:
 *      Read data from an endpoint
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *      TUInt8 aEndpoint            -- Endpoint with data
 *      TUInt8 *aData               -- Pointer to place to put data.
 *      TUInt16 iMaxLen             -- Maximum number of bytes for data.
 * Outputs:
 *      TInt16                      -- Number of bytes received, or -1
 *-------------------------------------------------------------------------*/
static TInt16 NXP_LPC17xx_40xx_USBDevice_Read(
            void *aWorkspace,
            TUInt8 aEndpoint,
            TUInt8 *aData,
            TUInt16 iMaxLen)
{
    TInt16 numBytes;

    T_USBDevice_LPC17xx_40xx_Workspace *p =
        (T_USBDevice_LPC17xx_40xx_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    numBytes = (*p->iUSBDeviceController)->Read(
            p->iUSBDeviceController,
            aEndpoint,
            aData,
            iMaxLen);
    UEZSemaphoreRelease(p->iSem);

    return numBytes;
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC17xx_40xx_USBDevice_Write
 *-------------------------------------------------------------------------*
 * Description:
 *      Write data to an endpoint
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *      TUInt8 aEndpoint            -- Endpoint to receive data
 *      TUInt8 *aData               -- Pointer to data to send.
 *      TUInt16 aLength             -- Number of bytes to send
 * Outputs:
 *      TUInt16                     -- aLength
 *-------------------------------------------------------------------------*/
static TUInt16 NXP_LPC17xx_40xx_USBDevice_Write(
            void *aWorkspace,
            TUInt8 aEndpoint,
            TUInt8 *aData,
            TUInt16 iMaxLen)
{
    TUInt16 length;

    T_USBDevice_LPC17xx_40xx_Workspace *p =
        (T_USBDevice_LPC17xx_40xx_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    length = (*p->iUSBDeviceController)->Write(
            p->iUSBDeviceController,
            aEndpoint,
            aData,
            iMaxLen);
    UEZSemaphoreRelease(p->iSem);

