FutureDesigns/uEZ/uEZ/Source/Devices/USBDevice/NXP/LPC17xx_40xx/LPC17xx_40xx_USBDevice.c
    // Access the USBDevice HAL and link to this device
    HALInterfaceFind(
            aHALName,
            (T_halWorkspace **)&p->iUSBDeviceController);
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const DEVICE_USB_DEVICE USBDevice_NXP_LPC17xx_40xx_Interface = {
	{
	    // Common device interface
	    "USBDevice:NXP:LPC17xx_40xx",
	    0x0100,
	    USBDevice_NXP_InitializeWorkspace_USBDevice,
	    sizeof(T_USBDevice_LPC17xx_40xx_Workspace),
	},
	
    // Functions
    NXP_LPC17xx_40xx_USBDevice_Configure,
    NXP_LPC17xx_40xx_USBDevice_Initialize,
    NXP_LPC17xx_40xx_USBDevice_Connect,
    NXP_LPC17xx_40xx_USBDevice_Disconnect,
    NXP_LPC17xx_40xx_USBDevice_SetAddress,
    NXP_LPC17xx_40xx_USBDevice_EndpointConfigure,
    NXP_LPC17xx_40xx_USBDevice_Read,
    NXP_LPC17xx_40xx_USBDevice_Write,
    NXP_LPC17xx_40xx_USBDevice_SetStallState,
    NXP_LPC17xx_40xx_USBDevice_IsStalled,
    NXP_LPC17xx_40xx_USBDevice_EndpointInterruptsEnable,
    NXP_LPC17xx_40xx_USBDevice_EndpointInterruptsDisable,
    NXP_LPC17xx_40xx_USBDevice_ForceAddressAndConfiguration,
    NXP_LPC17xx_40xx_USBDevice_RegisterEndpointCallback,
    NXP_LPC17xx_40xx_USBDevice_UnregisterEndpointCallback,
    NXP_LPC17xx_40xx_USBDevice_RegisterRequestTypeCallback,
    NXP_LPC17xx_40xx_USBDevice_UnregisterRequestTypeCallback,
    NXP_LPC17xx_40xx_USBDevice_ProcessEndpoints,
    NXP_LPC17xx_40xx_USBDevice_InterruptNakEnable,
} ;

/*-------------------------------------------------------------------------*
 * End of File:  lpc1788_USBDevice.c
 *-------------------------------------------------------------------------*/
